test1

    checks.....................: 1.72%   ✓ 17650  ✗ 1004297
    data_received..............: 189 MB  1.6 MB/s
    data_sent..................: 100 MB  822 kB/s
    http_req_blocked...........: avg=417ns   min=0s      med=0s      max=12.18ms p(90)=1µs     p(95)=1µs
    http_req_connecting........: avg=72ns    min=0s      med=0s      max=2.3ms   p(90)=0s      p(95)=0s
    http_req_duration..........: avg=6.37ms  min=0s      med=0s      max=5.23s   p(90)=20.09ms p(95)=33.54ms
    http_req_receiving.........: avg=5.11µs  min=0s      med=0s      max=17.49ms p(90)=14µs    p(95)=24µs
    http_req_sending...........: avg=1.93µs  min=0s      med=0s      max=15.77ms p(90)=6µs     p(95)=8µs
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s      p(90)=0s      p(95)=0s
    http_req_waiting...........: avg=6.36ms  min=0s      med=0s      max=5.23s   p(90)=20.05ms p(95)=33.51ms
    http_reqs..................: 1233747 10139.215653/s
    iteration_duration.........: avg=42.44ms min=62.54µs med=10.42ms max=6.48s   p(90)=43.33ms p(95)=68.74ms
    iterations.................: 1021947 8398.594703/s
    vus........................: 101     min=9    max=999
    vus_max....................: 1000    min=1000 max=1000



    checks.....................: 1.73%   ✓ 16942  ✗ 961488
    data_received..............: 182 MB  1.5 MB/s
    data_sent..................: 96 MB   790 kB/s
    http_req_blocked...........: avg=451ns   min=0s      med=0s      max=3.74ms  p(90)=1µs     p(95)=2µs
    http_req_connecting........: avg=67ns    min=0s      med=0s      max=1.54ms  p(90)=0s      p(95)=0s
    http_req_duration..........: avg=7.26ms  min=0s      med=0s      max=3.73s   p(90)=22.96ms p(95)=37.78ms
    http_req_receiving.........: avg=5.66µs  min=0s      med=0s      max=13.09ms p(90)=15µs    p(95)=28µs
    http_req_sending...........: avg=2.2µs   min=0s      med=0s      max=14.86ms p(90)=6µs     p(95)=10µs
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s      p(90)=0s      p(95)=0s
    http_req_waiting...........: avg=7.25ms  min=0s      med=0s      max=3.73s   p(90)=22.91ms p(95)=37.74ms
    http_reqs..................: 1181734 9725.828175/s
    iteration_duration.........: avg=44.32ms min=62.33µs med=11.19ms max=6.39s   p(90)=44.39ms p(95)=68.99ms
    iterations.................: 978430  8052.609184/s
    vus........................: 105     min=9    max=999
    vus_max....................: 1000    min=1000 max=1000